Revit 2027 API
AnalysisDisplayStyle.HasDiagramSettings Method
 If true style has diagram settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDiagramSettings()
Public Function HasDiagramSettings As Boolean
public:
bool HasDiagramSettings()
member HasDiagramSettings : unit -> bool
Return Value
Boolean
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace